app/controllers/video_controller.rb

INSERT INTO "videos" ("name", "video", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sample"], ["video", "sample.mp4"], ["created_at", "2024-02-20 12:03:28.246550"], ["updated_at", "2024-02-20 12:03:28.246550"]]
---
  def create
    @video = Video.new(video_params)
    if @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
	def show
		@video = Video.find(params[:id])

UPDATE "videos" SET "updated_at" = $1, "s3_url" = $2 WHERE "videos"."id" = $3  [["updated_at", "2024-02-20 13:02:21.470873"], ["s3_url", "https://gcc-vault-staging.s3.amazonaws.com/output.mp4"], ["id", 29]]
---
  def transcode_and_upload_video
    video_path = @video.video.path
    transcoded_video_dir = "#{Rails.root}/tmp/#{SecureRandom.hex}"
    FileUtils.mkdir_p(transcoded_video_dir)

    transcoded_video = "#{transcoded_video_dir}/output.mp4"
    transcoder = FFMPEG::Movie.new(video_path)
		options = {
			custom: %w(-c:v libx264 -c:a aac),
			preserve_aspect_ratio: :width,
			resolution: '640x360'
		}
    transcoder.transcode(transcoded_video, options)

    # Upload transcoded video to S3
    s3 = Aws::S3::Resource.new(
      access_key_id: ENV['AWS_ACCESS_KEY_ID'],
      secret_access_key: ENV['AWS_SECRET_ACCESS_KEY'],
      region: ENV['AWS_REGION']
    )
    obj = s3.bucket(ENV['S3_BUCKET']).object(File.basename(transcoded_video))
    obj.upload_file(transcoded_video)

    # Update the video attribute with the S3 URL
    @video.update(s3_url: obj.public_url)